export const CURRENCIES = [
    {
      code: 'IDR',
      symbol: 'Rp',
      flag: '🇮🇩',
      name: {
        en: 'Indonesian Rupiah',
        uk: 'Індонезійська рупія',
        ru: 'Индонезийская рупия',
      },
    },
    {
      code: 'THB',
      symbol: '฿',
      flag: '🇹🇭',
      name: {
        en: 'Thai Baht',
        uk: 'Тайський бат',
        ru: 'Тайский бат',
      },
    },
    {
      code: 'VND',
      symbol: '₫',
      flag: '🇻🇳',
      name: {
        en: 'Vietnamese Dong',
        uk: 'Вʼєтнамський донг',
        ru: 'Вьетнамский донг',
      },
    },
    {
      code: 'CNY',
      symbol: '¥',
      flag: '🇨🇳',
      name: {
        en: 'Chinese Yuan',
        uk: 'Китайський юань',
        ru: 'Китайский юань',
      },
    },
    {
      code: 'JPY',
      symbol: '¥',
      flag: '🇯🇵',
      name: {
        en: 'Japanese Yen',
        uk: 'Японська єна',
        ru: 'Японская иена',
      },
    },
    {
      code: 'KRW',
      symbol: '₩',
      flag: '🇰🇷',
      name: {
        en: 'South Korean Won',
        uk: 'Південнокорейська вона',
        ru: 'Южнокорейская вона',
      },
    },
    {
      code: 'INR',
      symbol: '₹',
      flag: '🇮🇳',
      name: {
        en: 'Indian Rupee',
        uk: 'Індійська рупія',
        ru: 'Индийская рупия',
      },
    },
    {
      code: 'SGD',
      symbol: 'S$',
      flag: '🇸🇬',
      name: {
        en: 'Singapore Dollar',
        uk: 'Сінгапурський долар',
        ru: 'Сингапурский доллар',
      },
    },
    {
      code: 'MYR',
      symbol: 'RM',
      flag: '🇲🇾',
      name: {
        en: 'Malaysian Ringgit',
        uk: 'Малайзійський ринггіт',
        ru: 'Малайзийский ринггит',
      },
    },
    {
      code: 'PHP',
      symbol: '₱',
      flag: '🇵🇭',
      name: {
        en: 'Philippine Peso',
        uk: 'Філіппінське песо',
        ru: 'Филиппинское песо',
      },
    },
  
    {
      code: 'EUR',
      symbol: '€',
      flag: '🇪🇺',
      name: {
        en: 'Euro',
        uk: 'Євро',
        ru: 'Евро',
      },
    },
    {
      code: 'GBP',
      symbol: '£',
      flag: '🇬🇧',
      name: {
        en: 'British Pound',
        uk: 'Британський фунт',
        ru: 'Британский фунт',
      },
    },
    {
      code: 'UAH',
      symbol: '₴',
      flag: '🇺🇦',
      name: {
        en: 'Ukrainian Hryvnia',
        uk: 'Гривня',
        ru: 'Гривна',
      },
    },
    {
      code: 'PLN',
      symbol: 'zł',
      flag: '🇵🇱',
      name: {
        en: 'Polish Zloty',
        uk: 'Польський злотий',
        ru: 'Польский злотый',
      },
    },
    {
      code: 'CZK',
      symbol: 'Kč',
      flag: '🇨🇿',
      name: {
        en: 'Czech Koruna',
        uk: 'Чеська крона',
        ru: 'Чешская крона',
      },
    },
    {
      code: 'HUF',
      symbol: 'Ft',
      flag: '🇭🇺',
      name: {
        en: 'Hungarian Forint',
        uk: 'Форинт',
        ru: 'Форинт',
      },
    },
    {
      code: 'SEK',
      symbol: 'kr',
      flag: '🇸🇪',
      name: {
        en: 'Swedish Krona',
        uk: 'Шведська крона',
        ru: 'Шведская крона',
      },
    },
    {
      code: 'NOK',
      symbol: 'kr',
      flag: '🇳🇴',
      name: {
        en: 'Norwegian Krone',
        uk: 'Норвезька крона',
        ru: 'Норвежская крона',
      },
    },
    {
      code: 'DKK',
      symbol: 'kr',
      flag: '🇩🇰',
      name: {
        en: 'Danish Krone',
        uk: 'Датська крона',
        ru: 'Датская крона',
      },
    },
    {
      code: 'CHF',
      symbol: 'CHF',
      flag: '🇨🇭',
      name: {
        en: 'Swiss Franc',
        uk: 'Швейцарський франк',
        ru: 'Швейцарский франк',
      },
    },
  
    {
      code: 'USD',
      symbol: '$',
      flag: '🇺🇸',
      name: {
        en: 'US Dollar',
        uk: 'Долар США',
        ru: 'Доллар США',
      },
    },
    {
      code: 'CAD',
      symbol: 'C$',
      flag: '🇨🇦',
      name: {
        en: 'Canadian Dollar',
        uk: 'Канадський долар',
        ru: 'Канадский доллар',
      },
    },
    {
      code: 'MXN',
      symbol: '$',
      flag: '🇲🇽',
      name: {
        en: 'Mexican Peso',
        uk: 'Мексиканське песо',
        ru: 'Мексиканское песо',
      },
    },
    {
      code: 'BRL',
      symbol: 'R$',
      flag: '🇧🇷',
      name: {
        en: 'Brazilian Real',
        uk: 'Бразильський реал',
        ru: 'Бразильский реал',
      },
    },
    {
      code: 'ARS',
      symbol: '$',
      flag: '🇦🇷',
      name: {
        en: 'Argentine Peso',
        uk: 'Аргентинське песо',
        ru: 'Аргентинское песо',
      },
    },
  
    {
      code: 'ZAR',
      symbol: 'R',
      flag: '🇿🇦',
      name: {
        en: 'South African Rand',
        uk: 'Південноафриканський ранд',
        ru: 'Южноафриканский ранд',
      },
    },
    {
      code: 'RUB',
      symbol: '₽',
      flag: '🇷🇺',
      name: {
        en: 'Russian Ruble',
        uk: 'Російський рубль',
        ru: 'Российский рубль',
      },
    },
    {
      code: 'TRY',
      symbol: '₺',
      flag: '🇹🇷',
      name: {
        en: 'Turkish Lira',
        uk: 'Турецька ліра',
        ru: 'Турецкая лира',
      },
    },
    {
      code: 'ILS',
      symbol: '₪',
      flag: '🇮🇱',
      name: {
        en: 'Israeli Shekel',
        uk: 'Ізраїльський шекель',
        ru: 'Израильский шекель',
      },
    }
  ] as const;